RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_hpdf.c
    /* make sure the CHEN=0 */
    if(RESET == (HPDF_CHXCTL(channelx) & HPDF_CHXCTL_CHEN)) {
        reg = HPDF_CHXCFG1(channelx);
        reg &= ~(HPDF_CHXCFG1_TMSFO | HPDF_CHXCFG1_TMFOR);
        /* configure the threshold monitor filter order and oversample rate */
        reg |= (order | ((oversample - 1U) << CHXCFG1_TMFOR_OFFSET));
        HPDF_CHXCFG1(channelx) = reg;
    }
}

/*!
    \brief      read the threshold monitor filter data (API_ID(0x002C))
    \param[in]  channelx: CHANNELx(x=0..7)
    \param[out] none
    \retval     the threshold monitor filter data
*/
int16_t hpdf_threshold_monitor_filter_read_data(hpdf_channel_enum channelx)
{
    int16_t val;
    val = (int16_t)HPDF_CHXTMFDT(channelx);
    return val;
}

/*!
    \brief      disable threshold monitor fast mode (API_ID(0x002D))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_fast_mode_disable(hpdf_filter_enum filtery)
{
    HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_TMFM;
}

/*!
    \brief      enable threshold monitor fast mode (API_ID(0x002E))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_fast_mode_enable(hpdf_filter_enum filtery)
{
    HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_TMFM;
}

/*!
    \brief      configure threshold monitor channel (API_ID(0x002F))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  channel: which channel use threshold monitorx(x=0,1)
                one or more parameters can be selected which is shown as below:
      \arg        TMCHEN_DISABLE: threshold monitorx is disabled on all channel
      \arg        TMCHEN_CHANNELx(x=0..7) threshold monitor is enabled on channel x
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_channel(hpdf_filter_enum filtery, uint32_t channel)
{
    uint32_t reg;

    reg = HPDF_FLTYCTL1(filtery);
    reg &= ~HPDF_FLTYCTL1_TMCHEN;
    /* configure the channel which threshold monitor watch on */
    reg |= channel;
    HPDF_FLTYCTL1(filtery) = reg;
}

/*!
    \brief      configure threshold monitor high threshold value (API_ID(0x0030))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  value: high threshold value(-8388608~8388607)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_high_threshold(hpdf_filter_enum filtery, int32_t value)
{
    uint32_t reg;

    reg = HPDF_FLTYTMHT(filtery);
    reg &= ~HPDF_FLTYTMHT_HTVAL;
    /* write the signed value */
    reg |= (uint32_t)value << FLTYTMHT_HTVAL_OFFSET;
    HPDF_FLTYTMHT(filtery) = reg;
}

/*!
    \brief      configure threshold monitor low threshold value(API_ID(0x0031))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  value: low threshold value(-8388608~8388607)
    \param[out] none
    \retval     none
*/
void hpdf_threshold_monitor_low_threshold(hpdf_filter_enum filtery, int32_t value)
{
    uint32_t reg;

    reg = HPDF_FLTYTMLT(filtery);
    reg &= ~HPDF_FLTYTMLT_LTVAL;
    /* write the signed value */
    reg |= (uint32_t)value << FLTYTMLT_LTVAL_OFFSET;
    HPDF_FLTYTMLT(filtery) = reg;
}

/*!
    \brief      configure threshold monitor high threshold event break signal (API_ID(0x0032))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  break_signal: HPDF break signal
                one or more parameters can be selected which is shown as below:
      \arg        NO_TM_HT_BREAK: break signal is not distributed to an threshold monitor high threshold event
      \arg        TM_HT_BREAKx(x=0..3): break signal x is distributed to an threshold monitor high threshold event
    \param[out] none
    \retval     none
*/
void hpdf_high_threshold_break_signal(hpdf_filter_enum filtery, uint32_t break_signal)
{
    uint32_t reg;

    reg = HPDF_FLTYTMHT(filtery);
    reg &= ~HPDF_FLTYTMHT_HTBSD;
    /* configure the break signal */
    reg |= break_signal;
    HPDF_FLTYTMHT(filtery) = reg;
}

/*!
    \brief      configure threshold monitor low threshold event break signal (API_ID(0x0033))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  break_signal: the HPDF break signal
                one or more parameters can be selected which is shown as below:
      \arg        NO_TM_LT_BREAK: break signal is not distributed to an threshold monitor low threshold event
      \arg        TM_LT_BREAKx(x=0..3): break signal x is distributed to an threshold monitor low threshold event
    \param[out] none
    \retval     none
*/
void hpdf_low_threshold_break_signal(hpdf_filter_enum filtery, uint32_t break_signal)
{
    uint32_t reg;

    reg = HPDF_FLTYTMLT(filtery);
    reg &= ~HPDF_FLTYTMLT_LTBSD;
    /* configure the break signal */
    reg |= break_signal;
    HPDF_FLTYTMLT(filtery) = reg;
}

/*!
    \brief      configure extremes monitor channel (API_ID(0x0034))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  channel: which channel use extremes monitor
                one or more parameters can be selected which is shown as below:
      \arg        EM_CHANNEL_DISABLE: extremes monitor y does not accept data from any channel
      \arg        EM_CHANNELx(x=0..7): extremes monitor accepts data from channel x
    \param[out] none
    \retval     none
*/
void hpdf_extremes_monitor_channel(hpdf_filter_enum filtery, uint32_t channel)
{
    uint32_t reg;

    reg = HPDF_FLTYCTL1(filtery);
    reg &= ~HPDF_FLTYCTL1_EMCS;
    /* configure the channel which channel use extremes monitor */
    reg |= channel;
    HPDF_FLTYCTL1(filtery) = reg;
}

/*!
    \brief      get the extremes monitor maximum value (API_ID(0x0035))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     the maximum value
*/
int32_t hpdf_extremes_monitor_maximum_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the maximum value */
    val = HPDF_FLTYEMMAX(filtery) >> FLTYEMMAX_MAXVAL_OFFSET;
    /* get the sign of value */
    if(val & SIGN_BIT_OFFSET) {
        val |= 0xFF000000U;
    }
    return (int32_t)val;
}

/*!
    \brief      get the extremes monitor minimum value (API_ID(0x0036))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     the minimum value
*/
int32_t hpdf_extremes_monitor_minimum_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the channel of maximum value */
    val = HPDF_FLTYEMMIN(filtery) >> FLTYEMMIN_MINVAL_OFFSET;
    /* get the sign of vlaue */
    if(val & SIGN_BIT_OFFSET) {
        val |= SIGNVAL_MASK;
    }
    return (int32_t)val;
}

/*!
    \brief      get the conversion timer value (API_ID(0x0037))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     count value of conversion time
*/
uint32_t hpdf_conversion_time_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the channel of maximum value */
    val = HPDF_FLTYCT(filtery) >> FLTYCT_CNVCNT_OFFSET;
    return val;
}

/*!
    \brief      disable regular conversions continuous mode (API_ID(0x0038))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_rc_continuous_disable(hpdf_filter_enum filtery)
{
    HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_RCCM;
}

/*!
    \brief      enable regular conversions continuous mode (API_ID(0x0039))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_rc_continuous_enable(hpdf_filter_enum filtery)
{
    HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_RCCM;
}

/*!
    \brief      start regular channel conversion by software (API_ID(0x003A))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_rc_start_by_software(hpdf_filter_enum filtery)
{
    HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_SRCS;
}

/*!
    \brief      disable regular conversion synchronously (API_ID(0x003B))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_rc_syn_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_RCSYN;
    }
}

/*!
    \brief      enable regular conversion synchronously (API_ID(0x003C))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_rc_syn_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_RCSYN;
    }
}

/*!
    \brief      disable regular conversion DMA channel (API_ID(0x003D))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_rc_dma_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_RCDMAEN;
    }
}

/*!
    \brief      enable regular conversion DMA channel (API_ID(0x003E))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_rc_dma_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_RCDMAEN;
    }
}

/*!
    \brief      configure regular conversion channel (API_ID(0x003F))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  channel: the regular conversion channel selection
                only one parameter can be selected which is shown as below:
      \arg        RCS_CHANNELx(x=0..7): regular conversion channel
    \param[out] none
    \retval     none
*/
void hpdf_rc_channel_config(hpdf_filter_enum filtery, uint32_t channel)
{
    uint32_t reg;

    reg = HPDF_FLTYCTL0(filtery);
    reg &= ~HPDF_FLTYCTL0_RCS;
    reg |= channel;
    HPDF_FLTYCTL0(filtery) = reg;
}

/*!
    \brief      disable regular conversion fast conversion mode (API_ID(0x0040))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_rc_fast_mode_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_FAST;
    }
}

/*!
    \brief      enable regular conversion fast conversion mode (API_ID(0x0041))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_rc_fast_mode_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_FAST;
    }
}

/*!
    \brief      get the regular conversions data (API_ID(0x0042))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     regular conversions data
*/
int32_t hpdf_rc_data_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the signed data */
    val = HPDF_FLTYRDATA(filtery) >> FLTYRDATAT_RDATA_OFFSET;
    /* get the sign of vlaue */
    if(val & SIGN_BIT_OFFSET) {
        val |= SIGNVAL_MASK;
    }
    return (int32_t)val;
}

/*!
    \brief      get the channel of regular group channel most recently converted (API_ID(0x0043))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     the channel
*/
uint8_t hpdf_rc_channel_get(hpdf_filter_enum filtery)
{
    uint8_t val;
    val = (uint8_t)HPDF_FLTYRDATA(filtery);
    val &= (uint8_t)HPDF_FLTYRDATA_RCCH;
    return val;
}

/*!
    \brief      start inserted channel conversion by software (API_ID(0x0044))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_ic_start_by_software(hpdf_filter_enum filtery)
{
    HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_SICC;
}

/*!
    \brief      disable inserted conversion synchronously (API_ID(0x0045))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_ic_syn_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_ICSYN;
    }
}

/*!
    \brief      enable inserted conversion synchronously (API_ID(0x0046))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_ic_syn_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_ICSYN;
    }
}

/*!
    \brief      disable inserted conversion DMA channel (API_ID(0x0047))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_ic_dma_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_ICDMAEN;
    }
}

/*!
    \brief      enable inserted conversion DMA channel (API_ID(0x0048))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_ic_dma_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_ICDMAEN;
    }
}

/*!
    \brief      disable scan conversion mode (API_ID(0x0049))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_ic_scan_mode_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_SCMOD;
    }
}

/*!
    \brief      enable scan conversion mode (API_ID(0x004A))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_ic_scan_mode_enable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) |= HPDF_FLTYCTL0_SCMOD;
    }
}

/*!
    \brief      disable inserted conversions trigger signal (API_ID(0x004B))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     none
*/
void hpdf_ic_trigger_signal_disable(hpdf_filter_enum filtery)
{
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {
        HPDF_FLTYCTL0(filtery) &= ~HPDF_FLTYCTL0_ICTEEN;
    }
}

/*!
    \brief      configure inserted conversions trigger signal and trigger edge (API_ID(0x004C))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  trigger: inserted conversions trigger signal
                only one parameter can be selected which is shown as below:
      \arg        HPDF_ITRG0: TIMER0_TRGO0 is selected to start inserted conversion
      \arg        HPDF_ITRG1: TIMER0_TRGO1 is selected to start inserted conversion
      \arg        HPDF_ITRG2: TIMER7_TRGO0 is selected to start inserted conversion
      \arg        HPDF_ITRG3: TIMER7_TRGO1 is selected to start inserted conversion
      \arg        HPDF_ITRG4: TIMER2_TRGO0 is selected to start inserted conversion
      \arg        HPDF_ITRG5: TIMER3_TRGO0 is selected to start inserted conversion
      \arg        HPDF_ITRG6: TIMER15_CH1 is selected to start inserted conversion
      \arg        HPDF_ITRG7: TIMER5_TRGO0 is selected to start inserted conversion
      \arg        HPDF_ITRG8: TIMER6_TRGO0 is selected to start inserted conversion
      \arg        HPDF_ITRG11: TIMER22_TRGO0 is selected to start inserted conversion
      \arg        HPDF_ITRG12: TIMER23_TRGO0 is selected to start inserted conversion
      \arg        HPDF_ITRG24: EXTI11 is selected to start inserted conversion
      \arg        HPDF_ITRG25: EXTI15 is selected to start inserted conversion
      \arg        HPDF_ITRG31: HPDF_ITRG is selected to start inserted conversion
    \param[in]  trigger_edge: inserted conversions trigger edge
                only one parameter can be selected which is shown as below:
      \arg        TRG_DISABLE: disable trigger signal
      \arg        RISING_EDGE_TRG: rising edge on the trigger signal
      \arg        FALLING_EDGE_TRG: falling edge on the trigger signal
      \arg        EDGE_TRG: edge (rising edges and falling edges) on the trigger signal
    \param[out] none
    \retval     none
*/
void hpdf_ic_trigger_signal_config(hpdf_filter_enum filtery, uint32_t trigger, uint32_t trigger_edge)
{
    uint32_t reg;

    /* make sure the FLTEN=0 */
    if(RESET == (HPDF_FLTYCTL0(filtery) & HPDF_FLTYCTL0_FLTEN)) {

        reg = HPDF_FLTYCTL0(filtery);
        reg &= ~(HPDF_FLTYCTL0_ICTEEN | HPDF_FLTYCTL0_ICTSSEL);
        /* configure inserted conversions trigger signal and trigger edge */
        reg |= (trigger | trigger_edge);
        HPDF_FLTYCTL0(filtery) = reg;
    }
}

/*!
    \brief      configure inserted group conversions channel (API_ID(0x004D))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  channel: the HPDF channel belongs to inserted group
                one or more parameters can be selected which is shown as below:
      \arg        ICGSEL_CHANNELx(x=0..7): channelx belongs to the inserted group
    \param[out] none
    \retval     none
*/
void hpdf_ic_channel_config(hpdf_filter_enum filtery, uint32_t channel)
{
    uint32_t reg;

    reg = HPDF_FLTYICGS(filtery);
    reg &= ~HPDF_FLTYICGS_ICGSEL;
    reg |= channel;
    HPDF_FLTYICGS(filtery) = reg;
}

/*!
    \brief      get the inserted conversions data (API_ID(0x004E))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     inserted conversions data
*/
int32_t hpdf_ic_data_get(hpdf_filter_enum filtery)
{
    uint32_t val;
    /* get the unsigned data  */
    val = HPDF_FLTYIDATA(filtery) >> FLTYIDATAT_IDATA_OFFSET;
    /* get the sign of value */
    if(val & SIGN_BIT_OFFSET) {
        val |= SIGNVAL_MASK;
    }
    /* get the signed data */
    return (int32_t)val;
}

/*!
    \brief      get the channel of inserted group channel most recently converted (API_ID(0x004F))
    \param[in]  filtery: FLTY(y=0..3)
    \param[out] none
    \retval     the channel
*/
uint8_t hpdf_ic_channel_get(hpdf_filter_enum filtery)
{
    uint8_t val;
    val = (uint8_t)HPDF_FLTYIDATA(filtery);
    val &= (uint8_t)HPDF_FLTYIDATA_ICCH;
    return val;
}

/*!
    \brief      enable sum threshold monitor (API_ID(0x0050))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hpdf_sum_threshold_monitor_enable(void)
{
    HPDF_FLTSUMTMCTL |= HPDF_FLTSUMTMCTL_STMEN;
}

/*!
    \brief      disable sum threshold monitor (API_ID(0x0051))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hpdf_sum_threshold_monitor_disable(void)
{
    HPDF_FLTSUMTMCTL &= ~HPDF_FLTSUMTMCTL_STMEN;
}

/*!
    \brief      enable sum threshold monitor fast mode (API_ID(0x0052))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hpdf_sum_threshold_monitor_fast_mode_enable(void)
{
    HPDF_FLTSUMTMCTL |= HPDF_FLTSUMTMCTL_STMFM;
}

/*!
    \brief      disable sum threshold monitor fast mode (API_ID(0x0053))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hpdf_sum_threshold_monitor_fast_mode_disable(void)
{
    HPDF_FLTSUMTMCTL &= ~HPDF_FLTSUMTMCTL_STMFM;
}

/*!
    \brief      select sum threshold monitor conversion data (API_ID(0x0054))
    \param[in]  data_a: conversion data A
                only one parameter can be selected which is shown as below:
      \arg        DATA_A_FLTx(x=0..3): conversion data A is from filterx
    \param[in]  data_b: conversion data B
                only one parameter can be selected which is shown as below:
      \arg        DATA_B_FLTx(x=0..3): conversion data B is from filterx
    \param[out] none
    \retval     none
*/
void hpdf_sum_threshold_monitor_conversion_data_config(uint32_t data_a, uint32_t data_b)
{
    uint32_t reg;
    reg = HPDF_FLTSUMTMCTL;
    reg &= ~(HPDF_FLTSUMTMCTL_CDASEL | HPDF_FLTSUMTMCTL_CDBSEL);
    reg |= (data_a & CDASEL_MASK) | (data_b & CDBSEL_MASK);
    HPDF_FLTSUMTMCTL = reg;
}

/*!
    \brief      select sum threshold monitor tm_filter data (API_ID(0x0055))
    \param[in]  data_a: tm_filter data A
                only one parameter can be selected which is shown as below:
      \arg        DATA_A_CHx(x=0..7): tm_filter data A is from channelx
    \param[in]  data_b: tm_filter data b
                only one parameter can be selected which is shown as below:
      \arg        DATA_B_CHx(x=0..7): tm_filter data B is from channelx
    \param[out] none
    \retval     none
*/
void hpdf_sum_threshold_monitor_tm_filter_data_config(uint32_t data_a, uint32_t data_b)
{
    uint32_t reg;
    reg = HPDF_FLTSUMTMCTL;
    reg &= ~(HPDF_FLTSUMTMCTL_TMFDASEL | HPDF_FLTSUMTMCTL_TMFDBSEL);
    reg |= (data_a & TMFDASEL_MASK) | (data_b & TMFDBSEL_MASK);
    HPDF_FLTSUMTMCTL = reg;
}

/*!
    \brief      configure sum threshold monitor high threshold value (API_ID(0x0056))
    \param[in]  value: high threshold value(-8388608~8388607)
    \param[out] none
    \retval     none
*/
void hpdf_sum_threshold_monitor_high_threshold(int32_t value)
{
    uint32_t reg;

