RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_hpdf.c
    reg = HPDF_FLTSUMTMHT;
    reg &= ~HPDF_FLTSUMTMHT_SHTVAL;
    /* write the signed value */
    reg |= (uint32_t)value << FLTSUMTMHT_SHTVAL_OFFSET;
    HPDF_FLTSUMTMHT = reg;
}

/*!
    \brief      configure sum threshold monitor low threshold value (API_ID(0x0057))
    \param[in]  value: low threshold value(-8388608~8388607)
    \param[out] none
    \retval     none
*/
void hpdf_sum_threshold_monitor_low_threshold(int32_t value)
{
    uint32_t reg;

    reg = HPDF_FLTSUMTMLT;
    reg &= ~HPDF_FLTSUMTMLT_SLTVAL;
    /* write the signed value */
    reg |= (uint32_t)value << FLTSUMTMLT_SLTVAL_OFFSET;
    HPDF_FLTSUMTMLT = reg;
}

/*!
    \brief      configure sum threshold monitor high threshold event break signal (API_ID(0x0058))
    \param[in]  break_signal: HPDF break signal
                one or more parameters can be selected which is shown as below:
      \arg        NO_SUMTM_HT_BREAK: break signal is not distributed to the sum threshold monitor high threshold event
      \arg        SUMTM_HT_BREAKx(x=0..3): break signal x is distributed to the sum threshold monitor high threshold event
    \param[out] none
    \retval     none
*/
void hpdf_sum_high_threshold_break_signal(uint32_t break_signal)
{
    uint32_t reg;
    reg = HPDF_FLTSUMTMHT;
    reg &= ~HPDF_FLTSUMTMHT_SHTBSD;
    /* configure the break signal */
    reg |= (break_signal & SHTBSD_MASK);
    HPDF_FLTSUMTMHT = reg;
}

/*!
    \brief      configure sum threshold monitor low threshold event break signal (API_ID(0x0059))
    \param[in]  break_signal: HPDF break signal
                one or more parameters can be selected which is shown as below:
      \arg        NO_SUMTM_LT_BREAK: break signal is not distributed to the sum threshold monitor low threshold event
      \arg        SUMTM_LT_BREAKx(x=0..3): break signal x is distributed to the sum threshold monitor low threshold event
    \param[out] none
    \retval     none
*/
void hpdf_sum_low_threshold_break_signal(uint32_t break_signal)
{
    uint32_t reg;
    reg = HPDF_FLTSUMTMLT;
    reg &= ~HPDF_FLTSUMTMLT_SLTBSD;
    /* configure the break signal */
    reg |= (break_signal & SLTBSD_MASK);
    HPDF_FLTSUMTMLT = reg;
}

/*!
    \brief      get the HPDF flags (API_ID(0x005A))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  flag: HPDF flags, refer to hpdf_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_FLAG_FLTY_ICEF: FLTY inserted conversion end flag
      \arg        HPDF_FLAG_FLTY_RCEF: FLTY regular conversion end flag
      \arg        HPDF_FLAG_FLTY_ICDOF: FLTY inserted conversion data overflow flag
      \arg        HPDF_FLAG_FLTY_RCDOF: FLTY regular conversion data overflow flag
      \arg        HPDF_FLAG_FLTY_TMEOF: FLTY threshold monitor event occurred flag
      \arg        HPDF_FLAG_FLTY_ICPF: FLTY inserted conversion in progress flag
      \arg        HPDF_FLAG_FLTY_RCPF: FLTY regular conversion in progress flag
      \arg        HPDF_FLAG_FLT0_CKLFx(x=0..7): clock signal is lost on channel x flag
      \arg        HPDF_FLAG_FLT0_MMFx(x=0..7): malfunction event occurred on channel x flag
      \arg        HPDF_FLAG_FLTY_RCHPDT: FLTY inserted channel most recently converted
      \arg        HPDF_FLAG_FLTY_LTFx(x=0..7): threshold monitor low threshold flag on channel x flag
      \arg        HPDF_FLAG_FLTY_HTFx(x=0..7): threshold monitor high threshold flag on channel x flag
      \arg        HPDF_FLAG_SUMTMEOF: sum threshold monitor event occurred flag
      \arg        HPDF_FLAG_SUMHTF: sum threshold monitor high threshold flag
      \arg        HPDF_FLAG_SUMLTF: sum threshold monitor low threshold flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hpdf_flag_get(hpdf_filter_enum filtery, hpdf_flag_enum flag)
{
    FlagStatus flag_state = RESET;
    uint8_t isspecialflag = ((flag == HPDF_FLAG_SUMTMEOF) || (flag == HPDF_FLAG_SUMHTF) || (flag == HPDF_FLAG_SUMLTF)) ? 1U : 0U;

    if(isspecialflag) {
        if((flag == HPDF_FLAG_SUMTMEOF) || (flag == HPDF_FLAG_SUMHTF) || (flag == HPDF_FLAG_SUMLTF)) {
            if(HPDF_FLTSUMTMSTAT & (uint32_t)flag) {
                flag_state = SET;
            } else {
                flag_state = RESET;
            }
        }
    } else {
        switch(filtery) {
        case FLT0:
            /* get the flag in FLT0 register */
            if(RESET != (HPDF_REG_VAL(HPDF_FLT0, flag) & BIT(HPDF_BIT_POS(flag)))) {
                flag_state = SET;
            } else {
                flag_state = RESET;
            }
            break;
        case FLT1:
            /* get the flag in FLT1 register */
            if(RESET != (HPDF_REG_VAL(HPDF_FLT1, flag) & BIT(HPDF_BIT_POS(flag)))) {
                flag_state = SET;
            } else {
                flag_state = RESET;
            }
            break;
        case FLT2:
            /* get the flag in FLT2 register */
            if(RESET != (HPDF_REG_VAL(HPDF_FLT2, flag) & BIT(HPDF_BIT_POS(flag)))) {
                flag_state = SET;
            } else {
                flag_state = RESET;
            }
            break;
        case FLT3:
            /* get the flag in FLT3 register */
            if(RESET != (HPDF_REG_VAL(HPDF_FLT3, flag) & BIT(HPDF_BIT_POS(flag)))) {
                flag_state = SET;
            } else {
                flag_state = RESET;
            }
            break;
        default :
            break;
        }
    }
    return flag_state;
}

/*!
    \brief      clear the HPDF flags (API_ID(0x005B))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  flag: HPDF flags, refer to hpdf_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_FLAG_FLTY_ICEF: FLTY inserted conversion end flag
      \arg        HPDF_FLAG_FLTY_RCEF: FLTY regular conversion end flag
      \arg        HPDF_FLAG_FLTY_ICDOF: FLTY inserted conversion data overflow flag
      \arg        HPDF_FLAG_FLTY_RCDOF: FLTY regular conversion data overflow flag
      \arg        HPDF_FLAG_FLTY_TMEOF: FLTY threshold monitor event occurred flag
      \arg        HPDF_FLAG_FLT0_CKLFx(x=0..7): clock signal is lost on channel x flag
      \arg        HPDF_FLAG_FLT0_MMFx(x=0..7): malfunction event occurred on channel x flag
      \arg        HPDF_FLAG_FLTY_LTFx(x=0..7): threshold monitor low threshold flag on channel x flag
      \arg        HPDF_FLAG_FLTY_HTFx(x=0..7): threshold monitor high threshold flag on channel x flag
      \arg        HPDF_FLAG_SUMTMEOF:  sum threshold monitor event occurred flag
      \arg        HPDF_FLAG_SUMHTF: sum threshold monitor high threshold flag
      \arg        HPDF_FLAG_SUMLTF: sum threshold monitor low threshold flag
    \param[out] none
    \retval     none
*/
void hpdf_flag_clear(hpdf_filter_enum filtery, hpdf_flag_enum flag)
{
    if((flag == HPDF_FLAG_SUMTMEOF) || (flag == HPDF_FLAG_SUMHTF) || (flag == HPDF_FLAG_SUMLTF)) {
        HPDF_FLTSUMTMFC |= (uint32_t)flag;
    } else if(FLTYTMSTAT_REG_OFFSET == ((uint32_t)flag >> 6U)) {
        /* clear threshold monitor high threshold flag */
        HPDF_FLTYTMFC(filtery) |= BIT(HPDF_BIT_POS(flag));
    } else {
        switch(flag) {
        case HPDF_FLAG_FLTY_ICEF:
            /* read the inserted conversion data */
            HPDF_FLTYIDATA(filtery);
            break;
        case HPDF_FLAG_FLTY_RCEF:
            /* read the regular conversion data */
            HPDF_FLTYRDATA(filtery);
            break;
        case HPDF_FLAG_FLTY_TMEOF:
            /* clear the threshold monitor flag */
            HPDF_FLTYTMFC(filtery) |= (HPDF_FLTYTMFC_HTFC | HPDF_FLTYTMFC_LTFC);
            break;
        default :
            HPDF_FLTYINTC(filtery) |= BIT(HPDF_BIT_POS(flag));
            break;
        }
    }
}

/*!
    \brief      enable HPDF interrupt (API_ID(0x005C))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  interrupt: HPDF interrupts, refer to hpdf_interrupt_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_INT_FLTY_ICEIE: FLTY inserted conversion end interrupt enable
      \arg        HPDF_INT_FLTY_RCEIE: FLTY regular conversion end interrupt enable
      \arg        HPDF_INT_FLTY_ICDOIE: FLTY inserted conversion data overflow interrupt enable
      \arg        HPDF_INT_FLTY_RCDOIE: FLTY regular conversion data overflow interrupt enable
      \arg        HPDF_INT_FLTY_TMIE: FLTY threshold monitor interrupt enable
      \arg        HPDF_INT_FLT0_MMIE: malfunction monitor interrupt enable
      \arg        HPDF_INT_FLT0_CKLIE: clock loss interrupt enable
      \arg        HPDF_INT_SUMTMIE: sum threshold monitor interrupt enable
    \param[out] none
    \retval     none
*/
void hpdf_interrupt_enable(hpdf_filter_enum filtery, hpdf_interrupt_enum interrupt)
{
    if(interrupt == HPDF_INT_SUMTMIE) {
        HPDF_FLTSUMTMCTL |= (uint32_t)interrupt;
    } else {
        switch(filtery) {
        case FLT0:
            HPDF_REG_VAL(HPDF_FLT0, interrupt) |= BIT(HPDF_BIT_POS(interrupt));
            break;
        case FLT1:
            HPDF_REG_VAL(HPDF_FLT1, interrupt) |= BIT(HPDF_BIT_POS(interrupt));
            break;
        case FLT2:
            HPDF_REG_VAL(HPDF_FLT2, interrupt) |= BIT(HPDF_BIT_POS(interrupt));
            break;
        case FLT3:
            HPDF_REG_VAL(HPDF_FLT3, interrupt) |= BIT(HPDF_BIT_POS(interrupt));
            break;
        default :
            break;
        }
    }
}

/*!
    \brief      disable HPDF interrupt (API_ID(0x005D))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  interrupt: HPDF interrupts, refer to hpdf_interrupt_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_INT_FLTY_ICEIE: FLTY inserted conversion interrupt enable
      \arg        HPDF_INT_FLTY_RCEIE: FLTY regular conversion interrupt enable
      \arg        HPDF_INT_FLTY_ICDOIE: FLTY inserted conversion data overflow interrupt enable
      \arg        HPDF_INT_FLTY_RCDOIE: FLTY regular conversion data overflow interrupt enable
      \arg        HPDF_INT_FLTY_TMEOIE: FLTY threshold monitor interrupt enable
      \arg        HPDF_INT_FLT0_MMIE: malfunction monitor interrupt enable
      \arg        HPDF_INT_FLT0_CKLIE: clock loss interrupt enable
      \arg        HPDF_INT_SUMTMIE: sum threshold monitor interrupt enable
    \param[out] none
    \retval     none
*/
void hpdf_interrupt_disable(hpdf_filter_enum filtery, hpdf_interrupt_enum interrupt)
{
    if(interrupt == HPDF_INT_SUMTMIE) {
        HPDF_FLTSUMTMCTL &= ~(uint32_t)interrupt;
    } else {
        switch(filtery) {
        case FLT0:
            HPDF_REG_VAL(HPDF_FLT0, interrupt) &= ~BIT(HPDF_BIT_POS(interrupt));
            break;
        case FLT1:
            HPDF_REG_VAL(HPDF_FLT1, interrupt) &= ~BIT(HPDF_BIT_POS(interrupt));
            break;
        case FLT2:
            HPDF_REG_VAL(HPDF_FLT2, interrupt) &= ~BIT(HPDF_BIT_POS(interrupt));
            break;
        case FLT3:
            HPDF_REG_VAL(HPDF_FLT3, interrupt) &= ~BIT(HPDF_BIT_POS(interrupt));
            break;
        default :
            break;
        }
    }
}

/*!
    \brief      get the HPDF interrupt flags (API_ID(0x005E))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  int_flag: HPDF flags, refer to hpdf_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_INT_FLAG_FLTY_ICEF: FLTY inserted conversion end interrupt flag
      \arg        HPDF_INT_FLAG_FLTY_RCEF: FLTY regular conversion end interrupt flag
      \arg        HPDF_INT_FLAG_FLTY_ICDOF: FLTY inserted conversion data overflow interrupt flag
      \arg        HPDF_INT_FLAG_FLTY_RCDOF: FLTY regular conversion data overflow interrupt flag
      \arg        HPDF_INT_FLAG_FLTY_TMEOF: FLTY threshold monitor event occurred interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_CKLFx(x=0..7): clock signal is lost on channel x interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_MMFx(x=0..7): malfunction event occurred on channel x interrupt flag
      \arg        HPDF_INT_FLAG_SUMTMEOF: sum threshold monitor event occurred interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hpdf_interrupt_flag_get(hpdf_filter_enum filtery, hpdf_interrupt_flag_enum int_flag)
{
    FlagStatus flag_state = RESET;
    uint32_t int_enable = 0U, flags = 0U;
    uint32_t sumtm_stat = HPDF_FLTSUMTMSTAT;
    uint32_t sumtm_ctl = HPDF_FLTSUMTMCTL;

    if(int_flag == HPDF_INT_FLAG_SUMTMEOF) {
        if((sumtm_stat & (uint32_t)HPDF_INT_FLAG_SUMTMEOF) && (sumtm_ctl & (uint32_t)HPDF_FLTSUMTMCTL_STMIE)) {
            flag_state = SET;
        } else {
            flag_state = RESET;
        }
    } else {
        switch(filtery) {
        case FLT0:
            /* get the interrupt enable bit status */
            int_enable = (HPDF_REG_VAL(HPDF_FLT0, int_flag) & BIT(HPDF_BIT_POS(int_flag)));
            /* get the interrupt enable bit status */
            flags = (HPDF_REG_VAL2(HPDF_FLT0, int_flag) & BIT(HPDF_BIT_POS2(int_flag)));
            if(flags && int_enable) {
                flag_state = SET;
            } else {
                flag_state = RESET;
            }
            break;
        case FLT1:
            /* get the interrupt enable bit status */
            int_enable = (HPDF_REG_VAL(HPDF_FLT1, int_flag) & BIT(HPDF_BIT_POS(int_flag)));
            /* get the interrupt enable bit status */
            flags = (HPDF_REG_VAL2(HPDF_FLT1, int_flag) & BIT(HPDF_BIT_POS2(int_flag)));
            if(flags && int_enable) {
                flag_state = SET;
            } else {
                flag_state = RESET;
            }
            break;
        case FLT2:
            /* get the flag in FLT2 register */
            int_enable = (HPDF_REG_VAL(HPDF_FLT2, int_flag) & BIT(HPDF_BIT_POS(int_flag)));
            /* get the interrupt enable bit status */
            flags = (HPDF_REG_VAL2(HPDF_FLT2, int_flag) & BIT(HPDF_BIT_POS2(int_flag)));
            if(flags && int_enable) {
                flag_state = SET;
            } else {
                flag_state = RESET;
            }
            break;
        case FLT3:
            /* get the flag in FLT3 register */
            int_enable = (HPDF_REG_VAL(HPDF_FLT3, int_flag) & BIT(HPDF_BIT_POS(int_flag)));
            /* get the interrupt enable bit status */
            flags = (HPDF_REG_VAL2(HPDF_FLT3, int_flag) & BIT(HPDF_BIT_POS2(int_flag)));
            if(flags && int_enable) {
                flag_state = SET;
            } else {
                flag_state = RESET;
            }
            break;
        default :
            break;
        }
    }
    return flag_state;
}

/*!
    \brief      clear the HPDF interrupt flags (API_ID(0x005F))
    \param[in]  filtery: FLTY(y=0..3)
    \param[in]  int_flag: HPDF flags, refer to hpdf_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        HPDF_INT_FLAG_FLTY_ICEF: FLTY inserted conversion end interrupt flag
      \arg        HPDF_INT_FLAG_FLTY_RCEF: FLTY regular conversion end interrupt flag
      \arg        HPDF_INT_FLAG_FLTY_ICDOF: FLTY inserted conversion data overflow interrupt flag
      \arg        HPDF_INT_FLAG_FLTY_RCDOF: FLTY regular conversion data overflow interrupt flag
      \arg        HPDF_INT_FLAG_FLTY_TMEOF: FLTY threshold monitor event occurred interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_CKLFx(x=0..7): clock signal is lost on channelx interrupt flag
      \arg        HPDF_INT_FLAG_FLT0_MMFx(x=0..7): malfunction event occurred on channelx interrupt flag
      \arg        HPDF_INT_FLAG_SUMTMEOF: sum threshold monitor event occurred interrupt flag
    \param[out] none
    \retval     none
*/
void hpdf_interrupt_flag_clear(hpdf_filter_enum filtery, hpdf_interrupt_flag_enum int_flag)
{
    switch(int_flag) {
    case HPDF_INT_FLAG_FLTY_ICEF:
        /* read the inserted conversion data */
        HPDF_FLTYIDATA(filtery);
        break;
    case HPDF_INT_FLAG_FLTY_RCEF:
        /* read the regular conversion data */
        HPDF_FLTYRDATA(filtery);
        break;
    case HPDF_INT_FLAG_FLTY_TMEOF:
        /* clear the threshold monitor flag */
        HPDF_FLTYTMFC(filtery) |= (HPDF_FLTYTMFC_HTFC | HPDF_FLTYTMFC_LTFC);
        break;
    case HPDF_INT_FLAG_SUMTMEOF:
        /* clear the sum threshold monitor flag */
        HPDF_FLTSUMTMFC |= (HPDF_FLTSUMTMFC_SHTFC | HPDF_FLTSUMTMFC_SLTFC);
        break;
    default :
        HPDF_FLTYINTC(filtery) |= BIT(HPDF_BIT_POS2(int_flag));
        break;
    }
}
